#  ____                     __ _ _
# | __ ) _ __ _____      __/ _(_) | ___
# |  _ \| '__/ _ \ \ /\ / / |_| | |/ _ \
# | |_) | | |  __/\ V  V /|  _| | |  __/
# |____/|_|  \___| \_/\_/ |_| |_|_|\___|

# Brewfile for all machines

# Options
cask_args appdir: '~/Applications', require_sha: true

# Taps
tap 'homebrew/bundle'
tap 'go-task/tap'
tap 'jesseduffield/lazygit'
tap 'saulpw/vd'
tap 'wata727/tflint'

#############################################################
# Command Line                                              #
#############################################################

# CLI Essentials
#type name                                     description
brew 'git'                                     # Version controll
brew 'neovim'                                  # Text editor
brew 'tmux'                                    # Term multiplexer
brew 'akamai'                                  # CLI toolkit for working with Akamai's APIs
brew 'age'                                     # Simple, modern, secure file encryption
brew 'mas'                                     # Mac App Store command-line interface

# CLI Basics
#type name                                     description
brew 'aria2'                                   # Resuming download util (better wget)
brew 'bat'                                     # Output highlighting (better cat)
brew 'bat-extras'                              # Bash scripts that integrate bat with various command-line tools
brew 'broot'                                   # Interactive directory navigation
brew 'ctags'                                   # Indexing of file info + headers
brew 'diff-so-fancy'                           # Readable file compares (better diff)
brew 'duf'                                     # Get info on mounted disks (better df)
brew 'entr'                                    # Run command whenever file changes
brew 'eza'                                     # Listing files with info (better ls)
brew 'exiftool'                                # Read, write and modify exif data
brew 'fzf'                                     # Fuzzy file finder and filtering
brew 'hyperfine'                               # Benchmarking for arbitrary commands
brew 'jdupes'                                  # Duplicate file finder
brew 'just'                                    # Powerful command runner (better make)
brew 'jsonnet'                                 # Domain specific configuration language for defining JSON data
brew 'jq'                                      # Lightweight and flexible command-line JSON processor
brew 'jc'                                      # Serializes the output of command-line tools to structured JSON output
brew 'jd'                                      # JSON diff and patch
brew 'xq'                                      # Command-line XML and HTML beautifier and content extractor
brew 'yq'                                      # Process YAML, JSON, XML, CSV and properties documents from the CLI
brew 'most'                                    # Multi-window scroll pager (better less)
brew 'procs'                                   # Advanced process viewer (better ps)
brew 'ripgrep'                                 # Searching within files (better grep)
brew 'rsync'                                   # Fast incremental file transfer
brew 'sd'                                      # RegEx find and replace (better sed)
#brew 'thefuck'                                 # Auto-correct miss-typed commands
brew 'tokei'                                   # Count lines of code (better cloc)
brew 'tree'                                    # Directory listings as tree structure
brew 'trash-cli'                               # Record and restore removed files
brew 'watch'                                   # Run commands periorically
brew 'xsel'                                    # Copy paste access to the X clipboard
brew 'zoxide'                                  # Auto-learning navigation (better cd)


# CLI Monitoring and Performance Apps
brew 'bmon'                                    # Bandwidth utilization monitor
brew 'ctop'                                    # Container metrics and monitoring
brew 'bpytop'                                  # Resource monitoring (like htop)
brew 'dua-cli'                                 # Disk usage analyzer and monitor (better du)
brew 'glances'                                 # Resource monitor + web and API
brew 'goaccess'                                # Web log analyzer and viewer
brew 'gping'                                   # Interactive ping tool, with graph
brew 'speedtest-cli'                           # Command line speed test utility
brew 'monit'                                   # Manage and monitor processes, files, directories, and devices

# CLI Productivity Apps
#type name                                     description
brew 'aspell'                                  # Spell checker with better logic than ispell
brew 'buku'                                    # Powerful command-line bookmark manager
brew 'cmus'                                    # Music player with an ncurses based interface
brew 'khal'                                    # CLI calendar application
brew 'newsboat'                                # RSS/Atom feed reader for text terminals
brew 'rclone'                                  # Rsync for cloud storage
brew 'dstask'                                  # Git-powered personal task tracker
#brew 'timewarrior'                             # Command-line time tracking application
brew 'todo-txt'                                # Minimal, todo.txt-focused editor
brew 'jrnl'                                    # Command-line note taker
#brew 'nb'                                      # Command-line and local web note-taking, bookmarking, and archiving
brew 'jupyterlab'                              # Interactive environments for writing and running code


# Other Productivity Apps
#type name                                     description
#cask 'textsniper'                              # Extract text from images and other digital documents
cask 'maccy'                                   # Clipboard manager
#cask 'keyboard-maestro'                        # Automation software
#cask 'hazel'                                   # Automated organisation
cask 'itsycal'                                 # Menu bar calendar
#cask 'bartender'                               # Menu bar icon organiser


# CLI Development Suite
#type name                                     description
brew 'httpie'                                  # User-friendly cURL replacement (command-line HTTP client)
brew 'hurl'                                    # Run and Test HTTP Requests with plain text and curl
brew 'lazydocker'                              # Lazier way to manage everything docker
brew 'lazygit'                                 # Simple terminal UI for git commands
brew 'ant'                                     # Java build tool
brew 'ant-contrib'                             # Collection of tasks for Apache Ant
brew 'aws-shell'                               # Integrated shell for working with the AWS CLI
brew 'awscli'                                  # Official Amazon AWS command-line interface
brew 'cmake'                                   # Cross-platform make


# CLI External Services
cask 'ngrok'                                   # Reverse proxy for sharing localhost
brew 'tmate'                                   # Share a terminal session via internet
brew 'asciinema'                               # Recording + sharing terminal sessions
brew 'navi'                                    # Browse, search, read cheat sheets
brew 'tldr'                                    # Community-maintained docs (better man)
#brew 'eg-examples'                             # Useful examples at the command-line
brew 'm-cli'                                   # Swiss Army Knife for macOS

# CLI Fun
#type name                                     description
brew 'figlet'                                  # Banner-like program prints strings as ASCII art
brew 'neofetch'                                # Fast, highly customisable system info script
brew 'pv'                                      # Monitor data's progress through a pipe
brew 'ansiweather'                             # Weather in your terminal, with ANSI colors and Unicode symbols
brew 'countdown'                               # Terminal countdown timer
brew 'wtfutil'                                 # Personal information dashboard for your terminal

# CLI Improvements
#type name                                     description
brew 'zsh-autosuggestions'                     # Fish-like fast/unobtrusive autosuggestions for zsh
brew 'zsh-completions'                         # Additional completion definitions for zsh
brew 'zsh-navigation-tools'                    # Zsh curses-based tools, e.g. multi-word history searcher
brew 'zsh-syntax-highlighting'                 # Fish shell like syntax highlighting for zsh
brew 'grep'                                    # GNU grep, egrep and fgrep
brew 'dust'                                    # More intuitive version of du in rust
brew 'watson'                                  # Command-line tool to track (your) time
brew 'wdiff'                                   # Display word differences between text files
brew 'wget'                                    # Internet file retriever
brew 'zlib'                                    # General-purpose lossless data-compression library
brew 'fd'                                      # Simple, fast and user-friendly alternative to find
brew 'findutils'                               # Collection of GNU find, xargs, and locate
brew 'pstree'                                  # Show ps output as a tree
brew 'rename'                                  # Perl-powered file rename script with many helpful built-ins
brew 'rlwrap'                                  # Readline wrapper: adds readline support to tools that lack it
brew 'rm-improved'                             # Command-line deletion tool focused on safety, ergonomics, and performance
brew 'spark'                                   # Sparklines for the shell
brew 'sponge'                                  # Soak up standard input and write to a file
brew 'nnn'                                     # Tiny, lightning fast, feature-packed file manager

# CLI Editors
#type name                                     description
#brew 'emacs'                                   # GNU Emacs text editor
#brew 'helix'                                   # Post-modern modal text editor
brew 'vim'                                     # Vi 'workalike' with many additional features
brew 'nvim'                                    # New Vi 'workalike' with many additional features

#############################################################
# Software Development                                      #
#############################################################

# Development Apps
cask 'boop'                                    # Text transformation tool
cask 'iterm2'                                  # Better terminal emulator
cask 'bruno'                                   # HTTP API testing app
cask 'sourcetree'                              # Git visual client
cask 'visual-studio-code'                      # Code editor
cask 'wezterm'                                 # Even better terminal emulator
#cask 'kitty'

# Development Langs, Compilers, Package Managers and SDKs
brew 'gcc'                                     # GNU C++ compilers
brew 'go'                                      # Compiler for Go Lang
brew 'gobject-introspection'                   # Generate introspection data for GObject libraries
brew 'dep'                                     # Go dependency management tool
brew 'lua'                                     # Lua interpreter
brew 'luarocks'                                # Package manager for Lua
brew 'node'                                    # Node.js
brew 'nvm'                                     # Switching node versions
brew 'openjdk'                                 # Java development kit
brew 'jenv'                                    # Manage your Java environment
brew 'maven'                                   # Java-based project management
brew 'python'                                  # Python interpriter
brew 'pdm'                                     # Modern Python package and dependency manager supporting the latest PEP standards
brew 'rust'                                    # Rust language
brew 'ruby'
brew 'boost'                                   # Collection of portable C++ source libraries
brew 'deno'                                    # Secure runtime for JavaScript and TypeScript
brew 'pyenv'                                   # Python version management
brew 'pyenv-virtualenv'                        # Pyenv plugin to manage virtualenv
brew 'python-lxml'                             # Pythonic binding for the libxml2 and libxslt libraries
brew 'python@3.13'                             # Interpreted, interactive, object-oriented programming language
brew 'qemu'                                    # Generic machine emulator and virtualizer
brew 'qt@5'                                    # Cross-platform application and UI framework
#brew 'pipenv'                                 # Python dependency management tool
brew 'jmeter'                                  # Load testing and performance measurement application
brew 'uv'                                      # Python dependency management tool

# DevOps
#type name                                     description
#brew 'ansible'                                 # Automation
brew 'docker'                                  # Containers
brew 'docker-compose'                          # Isolated development environments using Docker
brew 'docker-credential-helper'                # Platform keystore credential helper for Docker
brew 'hadolint'                                # Smarter Dockerfile linter to validate best practices
#brew 'podman'                                  # Tool for managing OCI containers and pods
brew 'minikube'                                # Run a Kubernetes cluster locally
brew 'k9s'                                     # Kubernetes CLI To Manage Your Clusters In Style!
brew 'cosign'                                  # Container Signing
brew 'bash'                                    # Bourne-Again SHell, a UNIX command interpreter
brew 'bash-completion', link: false            # Programmable completion for Bash 3.2
brew 'pssh'                                    # Parallel versions of OpenSSH and related tools
cask 'powershell'                              # Command-line shell and scripting language
brew 'asdf'                                    # Extendable version manager with support for Ruby, Node.js, Erlang & mo
brew 'coreutils'                               # GNU File, Shell, and Text utilities
cask 'openlens'                                # Open source build of Lens Kubernetes IDE
brew 'mongosh'                                 # MongoDB Shell to connect, configure, query, and work with your MongoDB
cask 'mark-text'                               # Markdown editor
cask 'devtoys'                                 # Utilities designed to make common development tasks easier
cask 'devutils'                                # All-in-one toolbox for developers
cask 'dbeaver-community'                       # Universal database tool and SQL client
cask 'dbngin'                                  # Database version management tool
brew 'terragrunt'                              # Thin wrapper for Terraform e.g. for locking state
brew 'tfenv'                                   # Terraform version manager inspired by rbenv
brew 'tflint'                                  # Linter for Terraform files
brew 'tfsec'                                   # Static analysis security scanner for your terraform code
brew 'shellcheck'                              # Static analysis and lint tool, for (ba)sh scripts
brew 'sqlite'                                  # Command-line interface for SQLite
brew 'openjdk@11'                              # Development kit for the Java programming language
brew 'openssl@3'                               # Cryptography and SSL/TLS Toolkit
brew 'saulpw/vd/visidata'                      # Terminal utility for exploring and arranging tabular data
brew 'sfk'                                     # Command-line tools collection
brew 'lnav'                                    # Curses-based tool for viewing and analyzing log files

# Development Utils
#type name                                     description
#cask 'rsyncosx'                                # GUI for rsync
#cask 'sourcetree'                              # Graphical client for Git version control
#cask 'forklift'                                # Finder replacement and FTP, SFTP, WebDAV and Amazon s3 client
cask 'github'                                  # Desktop client for GitHub repositories
brew 'pre-commit'                              # Framework for managing multi-language pre-commit hooks
brew 'gh'                                      # GitHub command-line tool
brew 'git-extras'                              # Small git utilities
brew 'git-delta'                               # Syntax-highlighting pager for git and diff output
brew 'git-filter-repo'                         # Quickly rewrite git repository history
brew 'git-flow'                                # Extensions to follow Vincent Driessen's branching model
brew 'git-secrets'                             # Prevents you from committing sensitive information to a git repo
brew 'gitleaks'                                # Audit git repos for secrets
brew 'jesseduffield/lazygit/lazygit'           # A simple terminal UI for git commands, written in Go
#brew 'onefetch'                                # Command-line Git information tool
brew 'hub'                                     # Add GitHub support to git on the command-line
brew 'terminal-notifier'                       # Send macOS User Notifications from the command-line
brew 'tig'                                     # Text interface for Git repositories
brew 'ttygif'                                  # Converts a ttyrec file into gif files
brew 'watchman'                                # Watch files and take action when they change
brew 'curl'                                    # Get a file from an HTTP, HTTPS or FTP server
brew 'dateutils'                               # Tools to manipulate dates with a focus on financial data
brew 'difftastic'                              # Diff that understands syntax
cask 'diffmerge'                               # Visually compare and merge files
#cask 'beyond-compare'                          # Compare files and folders
brew 'direnv'                                  # Load/unload environment variables based on $PWD
#brew 'duck'                                    # Command-line interface for Cyberduck (a multi-protocol file transfer t
cask 'visual-studio-code'                      # Open-source code editor
#cask 'multipass'                               # Orchestrates virtual Ubuntu instances
cask 'ngrok'                                   # Reverse proxy, secure introspectable tunnels to localhost
brew 'the_silver_searcher'                     # Code-search similar to ack
brew 'gnu-indent'                              # C code prettifier
brew 'gnupg'                                   # GNU Pretty Good Privacy (PGP) package
brew 'gnuplot'                                 # Command-driven, interactive function plotting


# Network and Security Testing
#type name                                     description
#brew 'bettercap'                               # Network, scanning and monitoring
#brew 'nmap'                                    # Port scanning
#brew 'wrk'                                     # HTTP benchmarking
#cask 'burp-suite'                              # Web security testing
#brew 'dog'                                     # Command-line DNS client
#cask 'tunnelblick'                             # Free and open-source OpenVPN client
#cask 'mullvadvpn'                              # VPN client
#cask 'proxyman'                                # HTTP debugging proxy
#brew 'tailscale'                               # Easiest, most secure way to use WireGuard and 2FA
brew 'ipcalc'                                  # Calculate various network masks, etc. from a given IP address
#brew 'mtr'                                     # 'traceroute' and 'ping' in a single tool
#brew 'magic-wormhole'                          # Securely transfers data between computers

# Security Utilities
#type name                                     description
brew 'bcrypt'                                  # Encryption utility, using blowfish
#brew 'dnscrypt-proxy'                         # Proxy for using encrypted DNS
brew 'git-crypt'                               # Transparent encryption for git repos
#brew 'lynis'                                  # Scan system for common security issues
brew 'openssl'                                 # Cryptography and SSL/TLS Toolkit
#brew 'rkhunter'                               # Search / detect potential root kits
#cask 'veracrypt'                              # File and volume encryption
brew 'diceware'                                # Passphrases to remember
cask 'gpg-suite-no-mail'                       # Tools to protect your files
brew 'pinentry-mac'                            # Pinentry for GPG on Mac
brew 'gnutls'                                  # GNU Transport Layer Security (TLS) Library
brew 'sops'                                    # Editor of encrypted files
brew 'sslscan'                                 # Test SSL/TLS enabled services to discover supported cipher suites
brew 'mkcert'                                  # Simple tool to make locally trusted development certificates
brew 'paperkey'                                # Extract just secret information out of OpenPGP secret keys
brew 'envchain'                                # Secure your credentials in environment variables
brew 'sqlcipher'                               # SQLite extension providing 256-bit AES encryption
brew 'pass'                                    # Password manager
brew 'gopass'                                  # Slightly more awesome Standard Unix Password Manager for Teams
brew 'passwdqc'                                # Password/passphrase strength checking and enforcement toolset
brew 'pwgen'                                   # Password generator

# Media
#type name                                     description
brew 'pandoc'                                  # Swiss-army knife of markup format conversion
brew 'asciidoc'                                # Formatter/translator for text files to numerous formats
brew 'docbook'                                 # Standard XML representation system for technical documents
cask 'basictex'                                # Compact TeX distribution as alternative to the full TeX Live / MacTeX
brew 'doitlive'                                # Replay stored shell commands for live presentations
brew 'snownews'                                # Text mode RSS newsreader
#brew 'hugo'                                    # Configurable static site generator
brew 'graphviz'                                # Graph visualization software from AT&T and Bell Labs
brew 'imagemagick'                             # Tools and libraries to manipulate images in many formats

# Social
#type name                                     description
cask 'microsoft-teams'                         # Meet, chat, call, and collaborate in just one place
cask 'webex'                                   # Video communication and virtual meeting platform
cask 'zoom'                                    # Video communication and virtual meeting platform
cask 'signal'                                  # Instant messaging application focusing on security
cask 'slack'                                   # Team communication and collaboration software


# Personal Applications
#type name                                     description
#cask '1password-cli'                           # Password manager (proprietary)
#cask '1password'                               # Password manager (proprietary)
#cask 'standard-notes'                          # Encrypted synced notes
cask 'signal'                                  # Link to encrypted mobile messenger
#cask 'mountain-duck'                           # Mount remote storage locations
cask 'keepassxc'                               # Password manager app


# Browsers
#type name                                     description
cask 'firefox-developer-edition'               # Web browser
cask 'chromium'                                # Free and open-source web browser
#cask 'brave-browser'                           # Web browser focusing on privacy
cask 'google-chrome'                           # Web browser
cask 'microsoft-edge'                          # Web browser
cask 'vivaldi'                                 # Web browser with built-in email client focusing on customization and c
brew 'lynx'                                    # Text-based web browser
brew 'httrack'                                 # Website copier/offline browser
brew 'browsh'                                  # Web browser, in terminal

#############################################################
# MacOS-Specific Stuff                                      #
#############################################################

# Fonts
cask 'font-fira-code'
cask 'font-hack'
cask 'font-inconsolata'
cask 'font-meslo-lg-nerd-font'
cask 'font-hack-nerd-font'
cask 'font-jetbrains-mono-nerd-font'


# Mac OS Mods and Improvements
cask 'alt-tab'                                   # Much better alt-tab window switcher
cask 'espanso'                                   # Live text expander (cross-platform)
cask 'finicky'                                   # Website-specific default browser
cask 'raycast', args: { require_sha: false }     # Spotlight alternative
cask 'shottr'                                    # Better screenshot utility
cask 'stats'                                     # System resource usage in menubar


# Mac OS Utility Apps
# type  name                                     description
cask   'drawio'                                  # Online diagram software
cask   'coteditor'                               # Plain-text editor for web pages, program source codes and more
cask   'textmate'                                # General-purpose text editor
cask   'keka'                                    # File archiver
cask   'acorn'                                   # Image editor focused on simplicity
cask   'appcleaner'                              # Application uninstaller
brew   'markdown'                                # Text-to-HTML conversion tool
brew   'mdp'                                     # Command-line based markdown presentation tool



# EOF
